import { showScreen } from "./screenManager.js";
import { menu, greetingScreen, greetingBtn } from "./valueScreen.js";
import { createRain } from "./rain.js"

export function initGreeting() {
    const greetingBack = document.getElementById("greetingBack");
    const thanksBtn = document.getElementById("thanksBtn");
    const textContainer = document.getElementById("finalGreetingText");
    const rainBg = greetingScreen.querySelector(".rain-bg");

    const fullWish = `Твій День Народження

        Пройшов ще один рік. Ти спробувала змінити цілий світ навколо себе. Ти дуже смілива. Твоє життя тільки починається, ти тільки починаєшся; розквітаєш, як букет, який тільки і чекав, доки його поставлять у воду. Вода на тебе тільки і чекаю

        Твій День Народження - це не новий аркуш, не чистий лист, а певний чекпоінт, точка збереження, де ти можеш озирнутись і зробити певні висновки, щоб відштовхуватися від них, щоб зрозуміти, куди рухатись далі, як продовжувати свій шлях, в що вкладатися, як жити. Твоє життя  - твій головний актив, не проєби його. Я ціную твоє життя і цей день. Для мене це важливо, бо цього дня зʼявилась така дуже-дуже Ти ✨ Люди сворюють навколо числа "магію", тому таким важливим 14 березня зробило твоє існування, а не збіг чисел. Дорожу цією датою )

        Ти добре мене знаєш: ніякі "особливі" дати мені непотрібні, щоб вкладати душу й тіло в декілька слів, кожен день, щоб зробити тобі трошки краще настрій, щоб ти відчувала, що ти потрібна, що твоє життя має значення, що тобою пишаються, піклуються і знаходяться поруч. Сьогодні я хочу  написати трошки інакше: опишу, якою я тебе бачу, використовуючи тільки прикметники:

        Маленька, молода, красива, 
        запланкана, сумна, всесильна,
        Знедолена. Вперта. Непочута.
        Мовчазна, розділена, закута.
        Розхитана, закрита, сильна. 
        Непорятована… Трагічна.
        Але ласкава, сонячна, грайлива, 
        прекрасна, дужа, непохитна, 
        осяйна, безмежна, легка, 
        лайлива, хтива, емоційна.
        Вишнева, зоряна, світла, блакитна.
        Неподоланна, росяниста…Ланітова 

        Ти неймовірна, Лєр

        Все ще вважаю, що найважливіше в житті людини - знайти своє щастя. Я хочу, щоб ти була Щасливою. Мене аж розчулило від цих слів. Знайти ту саму гармонію, знайти цей вибір, будь відповідальною за нього. Сенс життя кожної людини в щасті. Це не момент, не стан миттєвої радості, а процес усвідомлення себе, як величезної особистості, не маленького гвинтика, а цілого "Я". Саме такою я тебе бачу. До цього треба йти впродовж всього життя, шукати і все ти знайдеш. Це справді велика робота над собою. Щастя інтимне, не ділись ним ні з ким, нехай щастя не залежить від оцінок оточуючих. Нехай життя і буде твоїм сенсом, щоб ти в ньому знайшла розкидані шматочки душі. Будь щасливою, Лєрочка. Ти обовʼязково прийдеш до зрілої форми любові та визнання. (тут повинен бути смайлик твого щастя) 

        "І тільки тих поважають мільйони, хто поважає мільйони «Я»" – Василь Симоненко.

        Ти кохана Булочка. Навіть не знаю, що і сказати. Кохати складно. Не опускай ніколи руки, щоб не жалкувати потім. Я думаю, що воно варто того. Хоча я добре уявляю, як буду давати тобі по дупці за те, які дуже дивні ти робиш дії, та як закусаю, бо просто люблю. Нехай поруч завжди буде людина, якій ти довіриш свої мрії, сльози, переживання, - себе; кого захочеться захищати більше за всього, з ким ти відчуватимеш лише спокій та теплоту, задля кого захочеться змінювати, ламати себе, створювати, - з ким захочеш жити, бо це чесно по відношенню один до одного. Нехай завжди буде поруч той, кому ти віддала своє серденько. Але не забувай, що й самій потрібно докладати зусиль для цього. Одна людина нічого не може, якщо інша не хоче бачити цього. Саме такою є ти для мене. Тому Кохай! Ти вже є коханою! Я впевнений, ти варта, щоб тебе кохали, бо інакше б не писав про такі речі, інакше, був би зараз не тут ♥️

        Я в тебе вірю. Хто б що б не казав, але я в тебе вірю: в кожен твій маленький крок, в кожну твою перемогу та досягнення, в твою свідому особистість. Не розчаруй свою маленьку Лєроньку, у якої теж були мрії

        Будь Каменарем свого життя. Свободу в будь-якому прояві не дарують, її виборюють та вигризають. Твоє навчання в Харкові це теж прояв свободи, який ти сама для себе здобула, бо ти була сильною. Будь сильною завжди: поповнюй себе літературою сильних людей, думками титанічних праць. В решті, передивись Наруто - там багато важливих слів, які намагаються вплинути на цей світ, через намагання достукатись до тебе. Ти умнічка
        
        Сподіваюся ти ще побуваєш вдома: з нашою рябою в центрі, з АТБ цілодобовим, з Артемівським шампанським, шаленими бджілками, з "люди ми тільки тоді, як дуже сильно любимо", мівіною, моршинською, ловаре, миргородською, океаном ельзи, концертами групи "Нерви", Оболонью, Торчином, чумак, салтівськими ковбасами, Лєр, з Живчииииком! Всім серцем сподіваюсь, що ти все це побачиш. Я дуже хочу, щоб у тебе було все: щоб ти пишалась своїм вибором і знала, що ти робиш правильні, морально вірні речі. Щоб ти не боялась бути тою, ким ти є. Ти обовʼязково прогуляєшся своїми старими місцями. Це все ТВОЄ. Ти маєш право бути тою, ким ти захочеш. Не забувай про це

        Людини в будь-який момент може не стати. Мене може не стати. І все, що залишиться - спогади, емоції та слова на телефоні, в які колись були вложені сили та де залишилась частинка душі. Втратити тебе - найбільший мій страх, тому, Сонечко, знаходь час для важливих тобі людей: потягом, автобусом, попутками, возом чи пішки. Иди до них. Поки не пізно.

        Ти. З самого початку і до сьогоднішнього дня я ніколи в житті не жалкував, що познайомився з тобою. Дуже тебе ціную. Я тобі ніколи не відмовлю. Дякую тобі за все 🍃

        Минулого року я тобі сказав, як на мене, одні з найважливіших слів моїх слів в житті: що я тебе вважаю сімʼєю, що ти рідна. Це важливіше за кохаю та люблю. Це більше, ніж про вибір. Я ніс це цілий рік. Ще тоді побачив в тобі те, що несу й досі, хоч і виглядає воно не дуже, але все в цьому житті можна реанімувати. 

        З Днем твого Народження, рідна. Цей день є важливим для кожного по своєму. Я дуже ціную людину, якій вже уявляю, як відсилаю це привітання. Зроби сьогодні вдох та пробіжить по своєму життю. Можливо серед всіх цих моменті ти знайдеш своє Щастя. Я же, буду поряд з тобою: подам руку, коли ти попросиш, або ляжу біля тебе. Обійняв`; 

    textContainer.innerText = fullWish;

    function renderGreetingScreen() {
        textContainer.innerText = fullWish;
        const rainElements = ["❤️", "💖", "✨", "🌸"];

        const rainInterval = setInterval(() => {
            createRain(rainElements, rainBg);
        }, 300);

        greetingScreen.dataset.intervalId = rainInterval;
        
        showScreen(greetingScreen);
    }

    greetingBtn.onclick = renderGreetingScreen;

    const goBack = () => {
        clearInterval(greetingScreen.dataset.intervalId);
        showScreen(menu);
    };

    greetingBack.onclick = goBack;
    thanksBtn.onclick = goBack;
}
