import { showScreen } from "./screenManager.js";
import { menu, greetingScreen, greetingBtn } from "./valueScreen.js";
import { createRain } from "./rain.js"

export function initGreeting() {
    const greetingBack = document.getElementById("greetingBack");
    const thanksBtn = document.getElementById("thanksBtn");
    const textContainer = document.getElementById("finalGreetingText");
    // const rainBg = greetingScreen.querySelector("#rain-bg");
    const rainBg = greetingScreen.querySelector(".rain-bg");

    const fullWish = `Твій День Народження

        Пройшов ще один рік. Ти спробувала змінити цілий світ навколо себе. Ти дуже смілива. Твоє життя тільки починається, ти тільки починаєшся; розквітаєш, як букет, який тільки і чекав, доки його поставлять у воду. Вода на тебе тільки і чекаю

        Твій День Народження - це не новий аркуш, не чистий лист, а певний чекпоінт, точка збереження, де ти можеш озирнутись і зробити певні висновки, щоб відштовхуватися від них, щоб зрозуміти, куди рухатись далі, як продовжувати свій шлях, в що вкладатися, як жити. Твоє життя  - твій головний актив, не проєби його. Я ціную твоє життя і цей день. Для мене це важливо, бо цього дня зʼявилась така дуже-дуже Ти ✨ Люди сворюють навколо числа "магію", тому таким важливим 14 березня зробило твоє існування, а не збіг чисел. Дорожу цією датою )

        Ти добре мене знаєш: ніякі "особливі" дати мені непотрібні, щоб вкладати душу й тіло в декілька слів, кожен день, щоб зробити тобі трошки краще настрій, щоб ти відчувала, що ти потрібна, що твоє життя має значення, що тобою пишаються, піклуються і знаходяться поруч. Сьогодні я хочу  написати трошки інакше: опишу, якою я тебе бачу, використовуючи тільки прикметники:

        Маленька, молода, красива, 
        запланкана, сумна, всесильна,
        Знедолена. Вперта. Непочута.
        Мовчазна, розділена, закута.
        Розхитана, закрита, сильна. 
        Непорятована… Трагічна.
        Але ласкава, сонячна, грайлива, 
        прекрасна, дужа, непохитна, 
        осяйна, безмежна, легка, 
        лайлива, хтива, емоційна.
        Вишнева, зоряна, світла, блакитна.
        Неподоланна, росяниста…Ланітова 

        Ти неймовірна, Лєр

        Все ще вважаю, що найважливіше в житті людини - знайти своє щастя. Я хочу, щоб ти була Щасливою. Мене аж розчулило від цих слів. Знайти ту саму гармонію, знайти цей вибір, будь відповідальною за нього. Сенс життя кожної людини в щасті. Це не момент, не стан миттєвої радості, а процес усвідомлення себе, як величезної особистості, не маленького гвинтика, а цілого "Я". Саме такою я тебе бачу. До цього треба йти впродовж всього життя, шукати і все ти знайдеш. Це справді велика робота над собою. Щастя інтимне, не ділись ним ні з ким, нехай щастя не залежить від оцінок оточуючих. Нехай життя і буде твоїм сенсом, щоб ти в ньому знайшла розкидані шматочки душі. Будь щасливою, Лєрочка. Ти обовʼязково прийдеш до зрілої форми любові та визнання. (тут повинен бути смайлик твого щастя) 

        "І тільки тих поважають мільйони, хто поважає мільйони «Я»" – Василь Симоненко.

        Ти кохана Булочка. Навіть не знаю, що і сказати. Кохати складно. Не опускай ніколи руки, щоб не жалкувати потім. Я думаю, що воно варто того. Хоча я добре уявляю, як буду давати тобі по дупці за те, які дуже дивні ти робиш дії, та як закусаю, бо просто люблю. Нехай поруч завжди буде людина, якій ти довіриш свої мрії, сльози, переживання, - себе; кого захочеться захищати більше за всього, з ким ти відчуватимеш лише спокій та теплоту, задля кого захочеться змінювати, ламати себе, створювати, - з ким захочеш жити, бо це чесно по відношенню один до одного. Нехай завжди буде поруч той, кому ти віддала своє серденько. Але не забувай, що й самій потрібно докладати зусиль для цього. Одна людина нічого не може, якщо інша не хоче бачити цього. Саме такою є ти для мене. Тому Кохай! Ти вже є коханою! Я впевнений, ти варта, щоб тебе кохали, бо інакше б не писав про такі речі, інакше, був би зараз не тут ♥️

        Я в тебе вірю. Хто б що б не казав, але я в тебе вірю: в кожен твій маленький крок, в кожну твою перемогу та досягнення, в твою свідому особистість. Не розчаруй свою маленьку Лєроньку, у якої теж були мрії

        Будь Каменарем свого життя. Свободу в будь-якому прояві не дарують, її виборюють та вигризають. Твоє навчання в Харкові це теж прояв свободи, який ти сама для себе здобула, бо ти була сильною. Будь сильною завжди: поповнюй себе літературою сильних людей, думками титанічних праць. В решті, передивись Наруто - там багато важливих слів, які намагаються вплинути на цей світ, через намагання достукатись до тебе. Ти умнічка `; 

    textContainer.innerText = fullWish;

    function renderGreetingScreen() {
        textContainer.innerText = fullWish;
        const rainElements = ["❤️", "💖", "✨", "🌸"];
        // Запускаємо сердечка
        const rainInterval = setInterval(() => {
            createRain(rainElements, rainBg);
        }, 300);
        // const rainInterval = setInterval(createRain(rainElements, heartsBg), 300);
        
        // Зберігаємо інтервал, щоб зупинити його при виході
        greetingScreen.dataset.intervalId = rainInterval;
        
        showScreen(greetingScreen);
    }

    greetingBtn.onclick = renderGreetingScreen;

    const goBack = () => {
        clearInterval(greetingScreen.dataset.intervalId);
        showScreen(menu);
    };

    greetingBack.onclick = goBack;
    thanksBtn.onclick = goBack;
}
